In [3]:
import numpy as np
import pandas as pd

In [4]:
x = pd.Series([10, 20, 30, 40, 50])

In [5]:
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
x.values

array([10, 20, 30, 40, 50], dtype=int64)

In [8]:
x.dtype

dtype('int64')

In [9]:
data = [450, 650, 870]
sales = pd.Series(data, index=['Bob', 'Sally', 'Don'])
sales

Bob      450
Sally    650
Don      870
dtype: int64

In [10]:
sales['Bob']

450

In [11]:
sales[0]

450

In [13]:
sales[sales > 500]

Sally    650
Don      870
dtype: int64

In [14]:
'Don' in sales

True

In [15]:
650 in sales.values

True

In [16]:
sales_dict = sales.to_dict()
sales_dict

{'Bob': 450, 'Sally': 650, 'Don': 870}

In [17]:
sales_ser = pd.Series(sales_dict)
sales_ser

Bob      450
Sally    650
Don      870
dtype: int64

In [18]:
new_sales = pd.Series(sales, index=['Don', 'Sally', 'Lucy', 'Mike', 'Bob'])
new_sales

Don      870.0
Sally    650.0
Lucy       NaN
Mike       NaN
Bob      450.0
dtype: float64

In [20]:
np.isnan(new_sales)

Don      False
Sally    False
Lucy      True
Mike      True
Bob      False
dtype: bool

In [21]:
pd.isnull(new_sales)

Don      False
Sally    False
Lucy      True
Mike      True
Bob      False
dtype: bool

In [23]:
new_sales.index.name = 'Sales Person'
new_sales

Sales Person
Don      870.0
Sally    650.0
Lucy       NaN
Mike       NaN
Bob      450.0
dtype: float64

In [24]:
new_sales.name = 'Total Sales'
new_sales

Sales Person
Don      870.0
Sally    650.0
Lucy       NaN
Mike       NaN
Bob      450.0
Name: Total Sales, dtype: float64

In [25]:
data = [['Don', 870], ['Sally', 678], ['Bob', 475]]
df = pd.DataFrame(data, columns=['Name', 'Sales'])
df

    Name  Sales
0    Don    870
1  Sally    678
2    Bob    475

In [26]:
df_dict = pd.DataFrame(sales_dict, index=['1'])
df_dict

   Bob  Sally  Don
1  450    650  870

In [27]:
dict_list = [{'Name':'Tom','Sales':250},{'Name':'Jane','Sales':300},{'Name':'Steve','Sales':350}
            ,{'Name':'Lucy','Sales':400}]

df_dict_list = pd.DataFrame(dict_list)
df_dict_list

    Name  Sales
0    Tom    250
1   Jane    300
2  Steve    350
3   Lucy    400

In [28]:
east = pd.Series([1000,1200,3400],index=['Q1','Q2','Q3'])
west = pd.Series([1100,1300,2400,3500],index=['Q1','Q2','Q3','Q4'])

In [29]:
df_region = pd.DataFrame({'East':east, 'West':west})
df_region

      East  West
Q1  1000.0  1100
Q2  1200.0  1300
Q3  3400.0  2400
Q4     NaN  3500

In [30]:
years = ['2015', '2016', '2017', '2018']
df_region['years'] = years
df_region

      East  West years
Q1  1000.0  1100  2015
Q2  1200.0  1300  2016
Q3  3400.0  2400  2017
Q4     NaN  3500  2018

In [31]:
df_region = df_region.set_index('years')

In [32]:
df_region

         East  West
years
2015   1000.0  1100
2016   1200.0  1300
2017   3400.0  2400
2018      NaN  3500

In [33]:
new_df = df_region.reindex(['2014', '2015', '2016', '2017', '2018', '2019'])
new_df

         East    West
years
2014      NaN     NaN
2015   1000.0  1100.0
2016   1200.0  1300.0
2017   3400.0  2400.0
2018      NaN  3500.0
2019      NaN     NaN

In [34]:
new_df = new_df.reindex(columns=['East', 'South', 'West', 'North'])
new_df

         East  South    West  North
years
2014      NaN    NaN     NaN    NaN
2015   1000.0    NaN  1100.0    NaN
2016   1200.0    NaN  1300.0    NaN
2017   3400.0    NaN  2400.0    NaN
2018      NaN    NaN  3500.0    NaN
2019      NaN    NaN     NaN    NaN